Repository: iRed4321/chat_sieve
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Hello World!
fr: Salut le Monde!

# pseudo
source: Nicknames
fr: Pseudos

# home
source: Summarize
fr: Résumer

source: Settings
fr: Paramètres

# runSummerization
source: Summarize !
fr: Résumer !

# convName
source: Name of the conversation to summarize
fr: Nom de la conversation à résumer

# apiKey
source: Your OpenAI API Key
fr: Votre clé d'API OpenAI

# loadJson
source: Load notifications from a json file. This will erase all previous saved notifications.
fr: Charger des notifications depuis un fichier Json. Cela supprimera tout les messages précédemment enregistrés.

# deleteAll
source: Delete all the notifications messages saved, this action can't be undone
fr: Supprimer tout les messages enregistrés, cette action est définitive.

# deleteAllSummaries
source: Delete all the summaries saved, this action can't be undone
fr: Supprimer tout les résumés enregistrés, cette action est définitive.

# exportJson
source: Export all the notifications messages saved in a json file
fr: Exporter les notifications de messages enregistrés au format Json.

# addBtn
source: Import
fr: Importer

# exportBtn
source: Export
fr: Exporter

# deleteBtn
source: Delete
fr: Supprimer

# outputLength
source: Length of the summary
fr: Longueur du résumé

# errorHttp
source: Error: Please check your internet access and your OpenAI API key validity.
fr: Erreur: Veuillez vérifier votre connexion internet et la validité de votre clé API OpenAI.

# importSuccess
source: {nbMsg} messages successfully loaded.
fr: {nbMsg} messages importés avec succès.

# peopleAdd
source: Add a nickname
fr: Ajouter un pseudo

# peopleChange
source: Change a nickname
fr: Modifier un pseudo

source: Cancel
fr: Annuler

source: Add
fr: Ajouter

source: Real name
fr: A la place de

# pseudoName
source: Nickname
fr: Afficher

# aiIntro
source: {prompt}. This conversation can be summarized in ${nbPoints} points:
fr: {prompt}. Cette conversation peut se résumer en ${nbPoints} points:

# lastMsgsSubtitle
source: The last messages of the conversation
fr: Les derniers messages de la conversation

source: Advanced settings
fr: Paramètres avancés

# service
source: Notifications reception
fr: Réception des notifications

# serviceActive
source: Service enabled
fr: Service actif

# serviceUnactive
source: Service disabled
fr: Service désactivé

# waitingIsActive
source: Checking service state...
fr: Vérification de l'état du service...

# convNameDefault
source: My conversation
fr: Ma conversation
